app/controllers/movies_controller.rb

    def add_movie
      Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "release_date", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hardware"], ["release_date", "1990-09-14 00:00:00.000000"], ["rating", "R"], ["created_at", "2023-12-14 09:33:28.527451"], ["updated_at", "2023-12-14 09:33:28.527451"]]